       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIV-NUMS.

       DATA DIVISION.
       LINKAGE SECTION.
       01 NUM1-LINK      PIC S9(5)V99.
       01 NUM2-LINK      PIC S9(5)V99.
       01 RESULT-LINK    PIC S9(6)V99.

       PROCEDURE DIVISION USING NUM1-LINK, NUM2-LINK, RESULT-LINK.
           DIVIDE NUM1-LINK BY NUM2-LINK GIVING RESULT-LINK
           GOBACK.
