       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-GROSS.

       DATA DIVISION.
       LINKAGE SECTION.
       01  LNK-BASIC   PIC 9(5)V99.
       01  LNK-ALLOW   PIC 9(4)V99.
       01  LNK-GROSS   PIC 9(6)V99.
       PROCEDURE DIVISION USING LNK-BASIC, LNK-ALLOW, LNK-GROSS.
           COMPUTE LNK-GROSS = LNK-BASIC + LNK-ALLOW.
           EXIT PROGRAM.
