       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-NET.
       DATA DIVISION.
       LINKAGE SECTION.
       01  LNK-GROSS   PIC 9(6)V99.
       01  LNK-DEDUCT  PIC 9(4)V99.
       01  LNK-NET     PIC 9(6)V99.

       PROCEDURE DIVISION USING LNK-GROSS, LNK-DEDUCT, LNK-NET.
           COMPUTE LNK-NET = LNK-GROSS - LNK-DEDUCT.
           EXIT PROGRAM.
