       IDENTIFICATION DIVISION.
       PROGRAM-ID. REVERSE-FLOATS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INDEX       PIC 9(3) VALUE 1.
       01 WS-FLOATS.
          05 WS-FLOAT OCCURS 100 TIMES PIC 9(4)V99.
       01 WS-FLOAT-STR   PIC X(20).
       01 WS-DISP-FLOAT  PIC 9(4)V99.
       01 WS-INDEX-STR   PIC 9(3).

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 100
               MOVE WS-INDEX TO WS-INDEX-STR
               DISPLAY "Enter float #" WS-INDEX-STR ": " WITH NO ADVANCING
               ACCEPT WS-FLOAT-STR
               COMPUTE WS-FLOAT(WS-INDEX) = FUNCTION NUMVAL(WS-FLOAT-STR)
           END-PERFORM

           DISPLAY "Reversed Values:"

           PERFORM VARYING WS-INDEX FROM 100 BY -1 UNTIL 
           WS-INDEX < 1
               MOVE WS-FLOAT(WS-INDEX) TO WS-DISP-FLOAT
               MOVE WS-INDEX TO WS-INDEX-STR
               DISPLAY "Float " WS-INDEX-STR "#: " 
               WS-DISP-FLOAT
           END-PERFORM

           STOP RUN.
