       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCOUNT-BALANCE-COMPUTE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  ACCOUNT-BALANCE        PIC 9(4)V99  VALUE 1000.00.
       01  DEPOSIT-AMOUNT         PIC 9(3)V99  VALUE  250.00.
       01  WITHDRAWAL-AMOUNT      PIC 9(3)V99  VALUE  100.00.


       PROCEDURE DIVISION.
       
           DISPLAY "Initial Balance : " ACCOUNT-BALANCE.
           DISPLAY "Deposited       : " DEPOSIT-AMOUNT.
           DISPLAY "Withdrawn       : " WITHDRAWAL-AMOUNT.

           COMPUTE ACCOUNT-BALANCE = ACCOUNT-BALANCE + DEPOSIT-AMOUNT - 
               WITHDRAWAL-AMOUNT.

           DISPLAY "Final Balance   : " ACCOUNT-BALANCE.

           STOP RUN.
